I still have this problem

```
Terraform v0.13.5
+ provider registry.terraform.io/-/azurerm v2.39.0
+ provider registry.terraform.io/-/random v3.0.0
+ provider registry.terraform.io/hashicorp/azurerm v2.39.0
+ provider registry.terraform.io/hashicorp/random v3.0.0
```

```hcl
resource "azurerm_app_service_plan" "My-p-appServicePlan-01" {
  name                = "My-p-appServicePlan-01"
  location            = azurerm_resource_group.functionApp.location
  resource_group_name = azurerm_resource_group.functionApp.name
  kind                = "FunctionApp"
  reserved            = true
  sku {
    tier = "PremiumV2"
    size = "P1v2"
  }
}
```

Each time Terraform runs it tries to change 

```hcl
  # azurerm_app_service_plan.My-p-appServicePlan-01 must be replaced
-/+ resource "azurerm_app_service_plan" "My-p-appServicePlan-01" {
      ~ id                           = "/subscriptions/4****************/resourceGroups/My-p-functionApp-rg/providers/Microsoft.Web/serverfarms/My-p-appServicePlan-01" -> (known after apply)
      - is_xenon                     = false -> null
      ~ kind                         = "linux" -> "FunctionApp" # forces replacement
        location                     = "westeurope"
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ maximum_number_of_workers    = 30 -> (known after apply)
        name                         = "My-p-appServicePlan-01"
      - per_site_scaling             = false -> null
        reserved                     = true
        resource_group_name          = "My-p-functionApp-rg"
      - tags                         = {} -> null

      ~ sku {
          ~ capacity = 1 -> (known after apply)
            size     = "P1v2"
            tier     = "PremiumV2"
        }
    }
```

only solution is to set:
```hcl
    lifecycle {
    ignore_changes = [
      kind,
    ]
  }```